Revit 2024 API
BuiltInFailures.SystemNavigatorFailures Class
 Failures related with the system browser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class SystemNavigatorFailures
Visual Basic
Public NotInheritable Class SystemNavigatorFailures
Visual C++
public ref class SystemNavigatorFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SystemNavigatorFailures
See Also
BuiltInFailures.SystemNavigatorFailures Members
Autodesk.Revit.DB Namespace